synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usbc.h
/* -------- USBC_UECFG3 : (USBC Offset: 0x10C) (R/W 32) Endpoint Configuration Register -------- */
#define USBC_UECFG3_OFFSET          0x10C        /**< \brief (USBC_UECFG3 offset) Endpoint Configuration Register */
#define USBC_UECFG3_RESETVALUE      0x00000000   /**< \brief (USBC_UECFG3 reset_value) Endpoint Configuration Register */

#define USBC_UECFG3_EPBK_Pos        2            /**< \brief (USBC_UECFG3) Endpoint Bank */
#define USBC_UECFG3_EPBK            (0x1u << USBC_UECFG3_EPBK_Pos)
#define   USBC_UECFG3_EPBK_SINGLE_Val     0x0u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPBK_DOUBLE_Val     0x1u   /**< \brief (USBC_UECFG3)  */
#define USBC_UECFG3_EPBK_SINGLE     (USBC_UECFG3_EPBK_SINGLE_Val   << USBC_UECFG3_EPBK_Pos)
#define USBC_UECFG3_EPBK_DOUBLE     (USBC_UECFG3_EPBK_DOUBLE_Val   << USBC_UECFG3_EPBK_Pos)
#define USBC_UECFG3_EPSIZE_Pos      4            /**< \brief (USBC_UECFG3) Endpoint Size */
#define USBC_UECFG3_EPSIZE_Msk      (0x7u << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE(value)   ((USBC_UECFG3_EPSIZE_Msk & ((value) << USBC_UECFG3_EPSIZE_Pos)))
#define   USBC_UECFG3_EPSIZE_8_Val        0x0u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPSIZE_16_Val       0x1u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPSIZE_32_Val       0x2u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPSIZE_64_Val       0x3u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPSIZE_128_Val      0x4u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPSIZE_256_Val      0x5u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPSIZE_512_Val      0x6u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPSIZE_1024_Val     0x7u   /**< \brief (USBC_UECFG3)  */
#define USBC_UECFG3_EPSIZE_8        (USBC_UECFG3_EPSIZE_8_Val      << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE_16       (USBC_UECFG3_EPSIZE_16_Val     << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE_32       (USBC_UECFG3_EPSIZE_32_Val     << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE_64       (USBC_UECFG3_EPSIZE_64_Val     << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE_128      (USBC_UECFG3_EPSIZE_128_Val    << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE_256      (USBC_UECFG3_EPSIZE_256_Val    << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE_512      (USBC_UECFG3_EPSIZE_512_Val    << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPSIZE_1024     (USBC_UECFG3_EPSIZE_1024_Val   << USBC_UECFG3_EPSIZE_Pos)
#define USBC_UECFG3_EPDIR_Pos       8            /**< \brief (USBC_UECFG3) Endpoint Direction */
#define USBC_UECFG3_EPDIR           (0x1u << USBC_UECFG3_EPDIR_Pos)
#define   USBC_UECFG3_EPDIR_OUT_Val       0x0u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPDIR_IN_Val        0x1u   /**< \brief (USBC_UECFG3)  */
#define USBC_UECFG3_EPDIR_OUT       (USBC_UECFG3_EPDIR_OUT_Val     << USBC_UECFG3_EPDIR_Pos)
#define USBC_UECFG3_EPDIR_IN        (USBC_UECFG3_EPDIR_IN_Val      << USBC_UECFG3_EPDIR_Pos)
#define USBC_UECFG3_EPTYPE_Pos      11           /**< \brief (USBC_UECFG3) Endpoint Type */
#define USBC_UECFG3_EPTYPE_Msk      (0x3u << USBC_UECFG3_EPTYPE_Pos)
#define USBC_UECFG3_EPTYPE(value)   ((USBC_UECFG3_EPTYPE_Msk & ((value) << USBC_UECFG3_EPTYPE_Pos)))
#define   USBC_UECFG3_EPTYPE_CONTROL_Val  0x0u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPTYPE_BULK_Val     0x2u   /**< \brief (USBC_UECFG3)  */
#define   USBC_UECFG3_EPTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UECFG3)  */
#define USBC_UECFG3_EPTYPE_CONTROL  (USBC_UECFG3_EPTYPE_CONTROL_Val << USBC_UECFG3_EPTYPE_Pos)
#define USBC_UECFG3_EPTYPE_ISOCHRONOUS (USBC_UECFG3_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG3_EPTYPE_Pos)
#define USBC_UECFG3_EPTYPE_BULK     (USBC_UECFG3_EPTYPE_BULK_Val   << USBC_UECFG3_EPTYPE_Pos)
#define USBC_UECFG3_EPTYPE_INTERRUPT (USBC_UECFG3_EPTYPE_INTERRUPT_Val << USBC_UECFG3_EPTYPE_Pos)
#define USBC_UECFG3_REPNB_Pos       16           /**< \brief (USBC_UECFG3) Redirected Endpoint Number */
#define USBC_UECFG3_REPNB_Msk       (0xFu << USBC_UECFG3_REPNB_Pos)
#define USBC_UECFG3_REPNB(value)    ((USBC_UECFG3_REPNB_Msk & ((value) << USBC_UECFG3_REPNB_Pos)))
#define USBC_UECFG3_MASK            0x000F1974u  /**< \brief (USBC_UECFG3) MASK Register */

/* -------- USBC_UECFG4 : (USBC Offset: 0x110) (R/W 32) Endpoint Configuration Register -------- */
#define USBC_UECFG4_OFFSET          0x110        /**< \brief (USBC_UECFG4 offset) Endpoint Configuration Register */
#define USBC_UECFG4_RESETVALUE      0x00000000   /**< \brief (USBC_UECFG4 reset_value) Endpoint Configuration Register */

#define USBC_UECFG4_EPBK_Pos        2            /**< \brief (USBC_UECFG4) Endpoint Bank */
#define USBC_UECFG4_EPBK            (0x1u << USBC_UECFG4_EPBK_Pos)
#define   USBC_UECFG4_EPBK_SINGLE_Val     0x0u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPBK_DOUBLE_Val     0x1u   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPBK_SINGLE     (USBC_UECFG4_EPBK_SINGLE_Val   << USBC_UECFG4_EPBK_Pos)
#define USBC_UECFG4_EPBK_DOUBLE     (USBC_UECFG4_EPBK_DOUBLE_Val   << USBC_UECFG4_EPBK_Pos)
#define USBC_UECFG4_EPSIZE_Pos      4            /**< \brief (USBC_UECFG4) Endpoint Size */
#define USBC_UECFG4_EPSIZE_Msk      (0x7u << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE(value)   ((USBC_UECFG4_EPSIZE_Msk & ((value) << USBC_UECFG4_EPSIZE_Pos)))
#define   USBC_UECFG4_EPSIZE_8_Val        0x0u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_16_Val       0x1u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_32_Val       0x2u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_64_Val       0x3u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_128_Val      0x4u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_256_Val      0x5u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_512_Val      0x6u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_1024_Val     0x7u   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPSIZE_8        (USBC_UECFG4_EPSIZE_8_Val      << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_16       (USBC_UECFG4_EPSIZE_16_Val     << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_32       (USBC_UECFG4_EPSIZE_32_Val     << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_64       (USBC_UECFG4_EPSIZE_64_Val     << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_128      (USBC_UECFG4_EPSIZE_128_Val    << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_256      (USBC_UECFG4_EPSIZE_256_Val    << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_512      (USBC_UECFG4_EPSIZE_512_Val    << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_1024     (USBC_UECFG4_EPSIZE_1024_Val   << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPDIR_Pos       8            /**< \brief (USBC_UECFG4) Endpoint Direction */
#define USBC_UECFG4_EPDIR           (0x1u << USBC_UECFG4_EPDIR_Pos)
#define   USBC_UECFG4_EPDIR_OUT_Val       0x0u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPDIR_IN_Val        0x1u   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPDIR_OUT       (USBC_UECFG4_EPDIR_OUT_Val     << USBC_UECFG4_EPDIR_Pos)
#define USBC_UECFG4_EPDIR_IN        (USBC_UECFG4_EPDIR_IN_Val      << USBC_UECFG4_EPDIR_Pos)
#define USBC_UECFG4_EPTYPE_Pos      11           /**< \brief (USBC_UECFG4) Endpoint Type */
#define USBC_UECFG4_EPTYPE_Msk      (0x3u << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE(value)   ((USBC_UECFG4_EPTYPE_Msk & ((value) << USBC_UECFG4_EPTYPE_Pos)))
#define   USBC_UECFG4_EPTYPE_CONTROL_Val  0x0u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPTYPE_BULK_Val     0x2u   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPTYPE_CONTROL  (USBC_UECFG4_EPTYPE_CONTROL_Val << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE_ISOCHRONOUS (USBC_UECFG4_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE_BULK     (USBC_UECFG4_EPTYPE_BULK_Val   << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE_INTERRUPT (USBC_UECFG4_EPTYPE_INTERRUPT_Val << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_REPNB_Pos       16           /**< \brief (USBC_UECFG4) Redirected Endpoint Number */
#define USBC_UECFG4_REPNB_Msk       (0xFu << USBC_UECFG4_REPNB_Pos)
#define USBC_UECFG4_REPNB(value)    ((USBC_UECFG4_REPNB_Msk & ((value) << USBC_UECFG4_REPNB_Pos)))
#define USBC_UECFG4_MASK            0x000F1974u  /**< \brief (USBC_UECFG4) MASK Register */

