synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usbc.h
/* -------- USBC_UECFG5 : (USBC Offset: 0x114) (R/W 32) Endpoint Configuration Register -------- */
#define USBC_UECFG5_OFFSET          0x114        /**< \brief (USBC_UECFG5 offset) Endpoint Configuration Register */
#define USBC_UECFG5_RESETVALUE      0x00000000   /**< \brief (USBC_UECFG5 reset_value) Endpoint Configuration Register */

#define USBC_UECFG5_EPBK_Pos        2            /**< \brief (USBC_UECFG5) Endpoint Bank */
#define USBC_UECFG5_EPBK            (0x1u << USBC_UECFG5_EPBK_Pos)
#define   USBC_UECFG5_EPBK_SINGLE_Val     0x0u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPBK_DOUBLE_Val     0x1u   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPBK_SINGLE     (USBC_UECFG5_EPBK_SINGLE_Val   << USBC_UECFG5_EPBK_Pos)
#define USBC_UECFG5_EPBK_DOUBLE     (USBC_UECFG5_EPBK_DOUBLE_Val   << USBC_UECFG5_EPBK_Pos)
#define USBC_UECFG5_EPSIZE_Pos      4            /**< \brief (USBC_UECFG5) Endpoint Size */
#define USBC_UECFG5_EPSIZE_Msk      (0x7u << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE(value)   ((USBC_UECFG5_EPSIZE_Msk & ((value) << USBC_UECFG5_EPSIZE_Pos)))
#define   USBC_UECFG5_EPSIZE_8_Val        0x0u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_16_Val       0x1u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_32_Val       0x2u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_64_Val       0x3u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_128_Val      0x4u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_256_Val      0x5u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_512_Val      0x6u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_1024_Val     0x7u   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPSIZE_8        (USBC_UECFG5_EPSIZE_8_Val      << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_16       (USBC_UECFG5_EPSIZE_16_Val     << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_32       (USBC_UECFG5_EPSIZE_32_Val     << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_64       (USBC_UECFG5_EPSIZE_64_Val     << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_128      (USBC_UECFG5_EPSIZE_128_Val    << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_256      (USBC_UECFG5_EPSIZE_256_Val    << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_512      (USBC_UECFG5_EPSIZE_512_Val    << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_1024     (USBC_UECFG5_EPSIZE_1024_Val   << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPDIR_Pos       8            /**< \brief (USBC_UECFG5) Endpoint Direction */
#define USBC_UECFG5_EPDIR           (0x1u << USBC_UECFG5_EPDIR_Pos)
#define   USBC_UECFG5_EPDIR_OUT_Val       0x0u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPDIR_IN_Val        0x1u   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPDIR_OUT       (USBC_UECFG5_EPDIR_OUT_Val     << USBC_UECFG5_EPDIR_Pos)
#define USBC_UECFG5_EPDIR_IN        (USBC_UECFG5_EPDIR_IN_Val      << USBC_UECFG5_EPDIR_Pos)
#define USBC_UECFG5_EPTYPE_Pos      11           /**< \brief (USBC_UECFG5) Endpoint Type */
#define USBC_UECFG5_EPTYPE_Msk      (0x3u << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE(value)   ((USBC_UECFG5_EPTYPE_Msk & ((value) << USBC_UECFG5_EPTYPE_Pos)))
#define   USBC_UECFG5_EPTYPE_CONTROL_Val  0x0u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPTYPE_BULK_Val     0x2u   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPTYPE_CONTROL  (USBC_UECFG5_EPTYPE_CONTROL_Val << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE_ISOCHRONOUS (USBC_UECFG5_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE_BULK     (USBC_UECFG5_EPTYPE_BULK_Val   << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE_INTERRUPT (USBC_UECFG5_EPTYPE_INTERRUPT_Val << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_REPNB_Pos       16           /**< \brief (USBC_UECFG5) Redirected Endpoint Number */
#define USBC_UECFG5_REPNB_Msk       (0xFu << USBC_UECFG5_REPNB_Pos)
#define USBC_UECFG5_REPNB(value)    ((USBC_UECFG5_REPNB_Msk & ((value) << USBC_UECFG5_REPNB_Pos)))
#define USBC_UECFG5_MASK            0x000F1974u  /**< \brief (USBC_UECFG5) MASK Register */

/* -------- USBC_UECFG6 : (USBC Offset: 0x118) (R/W 32) Endpoint Configuration Register -------- */
#define USBC_UECFG6_OFFSET          0x118        /**< \brief (USBC_UECFG6 offset) Endpoint Configuration Register */
#define USBC_UECFG6_RESETVALUE      0x00000000   /**< \brief (USBC_UECFG6 reset_value) Endpoint Configuration Register */

#define USBC_UECFG6_EPBK_Pos        2            /**< \brief (USBC_UECFG6) Endpoint Bank */
#define USBC_UECFG6_EPBK            (0x1u << USBC_UECFG6_EPBK_Pos)
#define   USBC_UECFG6_EPBK_SINGLE_Val     0x0u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPBK_DOUBLE_Val     0x1u   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPBK_SINGLE     (USBC_UECFG6_EPBK_SINGLE_Val   << USBC_UECFG6_EPBK_Pos)
#define USBC_UECFG6_EPBK_DOUBLE     (USBC_UECFG6_EPBK_DOUBLE_Val   << USBC_UECFG6_EPBK_Pos)
#define USBC_UECFG6_EPSIZE_Pos      4            /**< \brief (USBC_UECFG6) Endpoint Size */
#define USBC_UECFG6_EPSIZE_Msk      (0x7u << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE(value)   ((USBC_UECFG6_EPSIZE_Msk & ((value) << USBC_UECFG6_EPSIZE_Pos)))
#define   USBC_UECFG6_EPSIZE_8_Val        0x0u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_16_Val       0x1u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_32_Val       0x2u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_64_Val       0x3u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_128_Val      0x4u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_256_Val      0x5u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_512_Val      0x6u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_1024_Val     0x7u   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPSIZE_8        (USBC_UECFG6_EPSIZE_8_Val      << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_16       (USBC_UECFG6_EPSIZE_16_Val     << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_32       (USBC_UECFG6_EPSIZE_32_Val     << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_64       (USBC_UECFG6_EPSIZE_64_Val     << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_128      (USBC_UECFG6_EPSIZE_128_Val    << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_256      (USBC_UECFG6_EPSIZE_256_Val    << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_512      (USBC_UECFG6_EPSIZE_512_Val    << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_1024     (USBC_UECFG6_EPSIZE_1024_Val   << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPDIR_Pos       8            /**< \brief (USBC_UECFG6) Endpoint Direction */
#define USBC_UECFG6_EPDIR           (0x1u << USBC_UECFG6_EPDIR_Pos)
#define   USBC_UECFG6_EPDIR_OUT_Val       0x0u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPDIR_IN_Val        0x1u   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPDIR_OUT       (USBC_UECFG6_EPDIR_OUT_Val     << USBC_UECFG6_EPDIR_Pos)
#define USBC_UECFG6_EPDIR_IN        (USBC_UECFG6_EPDIR_IN_Val      << USBC_UECFG6_EPDIR_Pos)
#define USBC_UECFG6_EPTYPE_Pos      11           /**< \brief (USBC_UECFG6) Endpoint Type */
#define USBC_UECFG6_EPTYPE_Msk      (0x3u << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE(value)   ((USBC_UECFG6_EPTYPE_Msk & ((value) << USBC_UECFG6_EPTYPE_Pos)))
#define   USBC_UECFG6_EPTYPE_CONTROL_Val  0x0u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPTYPE_BULK_Val     0x2u   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPTYPE_CONTROL  (USBC_UECFG6_EPTYPE_CONTROL_Val << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE_ISOCHRONOUS (USBC_UECFG6_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE_BULK     (USBC_UECFG6_EPTYPE_BULK_Val   << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE_INTERRUPT (USBC_UECFG6_EPTYPE_INTERRUPT_Val << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_REPNB_Pos       16           /**< \brief (USBC_UECFG6) Redirected Endpoint Number */
#define USBC_UECFG6_REPNB_Msk       (0xFu << USBC_UECFG6_REPNB_Pos)
#define USBC_UECFG6_REPNB(value)    ((USBC_UECFG6_REPNB_Msk & ((value) << USBC_UECFG6_REPNB_Pos)))
#define USBC_UECFG6_MASK            0x000F1974u  /**< \brief (USBC_UECFG6) MASK Register */

/* -------- USBC_UECFG7 : (USBC Offset: 0x11C) (R/W 32) Endpoint Configuration Register -------- */
#define USBC_UECFG7_OFFSET          0x11C        /**< \brief (USBC_UECFG7 offset) Endpoint Configuration Register */
#define USBC_UECFG7_RESETVALUE      0x00000000   /**< \brief (USBC_UECFG7 reset_value) Endpoint Configuration Register */

#define USBC_UECFG7_EPBK_Pos        2            /**< \brief (USBC_UECFG7) Endpoint Bank */
#define USBC_UECFG7_EPBK            (0x1u << USBC_UECFG7_EPBK_Pos)
#define   USBC_UECFG7_EPBK_SINGLE_Val     0x0u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPBK_DOUBLE_Val     0x1u   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPBK_SINGLE     (USBC_UECFG7_EPBK_SINGLE_Val   << USBC_UECFG7_EPBK_Pos)
#define USBC_UECFG7_EPBK_DOUBLE     (USBC_UECFG7_EPBK_DOUBLE_Val   << USBC_UECFG7_EPBK_Pos)
#define USBC_UECFG7_EPSIZE_Pos      4            /**< \brief (USBC_UECFG7) Endpoint Size */
#define USBC_UECFG7_EPSIZE_Msk      (0x7u << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE(value)   ((USBC_UECFG7_EPSIZE_Msk & ((value) << USBC_UECFG7_EPSIZE_Pos)))
#define   USBC_UECFG7_EPSIZE_8_Val        0x0u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_16_Val       0x1u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_32_Val       0x2u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_64_Val       0x3u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_128_Val      0x4u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_256_Val      0x5u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_512_Val      0x6u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_1024_Val     0x7u   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPSIZE_8        (USBC_UECFG7_EPSIZE_8_Val      << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_16       (USBC_UECFG7_EPSIZE_16_Val     << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_32       (USBC_UECFG7_EPSIZE_32_Val     << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_64       (USBC_UECFG7_EPSIZE_64_Val     << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_128      (USBC_UECFG7_EPSIZE_128_Val    << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_256      (USBC_UECFG7_EPSIZE_256_Val    << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_512      (USBC_UECFG7_EPSIZE_512_Val    << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_1024     (USBC_UECFG7_EPSIZE_1024_Val   << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPDIR_Pos       8            /**< \brief (USBC_UECFG7) Endpoint Direction */
#define USBC_UECFG7_EPDIR           (0x1u << USBC_UECFG7_EPDIR_Pos)
#define   USBC_UECFG7_EPDIR_OUT_Val       0x0u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPDIR_IN_Val        0x1u   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPDIR_OUT       (USBC_UECFG7_EPDIR_OUT_Val     << USBC_UECFG7_EPDIR_Pos)
#define USBC_UECFG7_EPDIR_IN        (USBC_UECFG7_EPDIR_IN_Val      << USBC_UECFG7_EPDIR_Pos)
#define USBC_UECFG7_EPTYPE_Pos      11           /**< \brief (USBC_UECFG7) Endpoint Type */
#define USBC_UECFG7_EPTYPE_Msk      (0x3u << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE(value)   ((USBC_UECFG7_EPTYPE_Msk & ((value) << USBC_UECFG7_EPTYPE_Pos)))
#define   USBC_UECFG7_EPTYPE_CONTROL_Val  0x0u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPTYPE_BULK_Val     0x2u   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPTYPE_CONTROL  (USBC_UECFG7_EPTYPE_CONTROL_Val << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE_ISOCHRONOUS (USBC_UECFG7_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE_BULK     (USBC_UECFG7_EPTYPE_BULK_Val   << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE_INTERRUPT (USBC_UECFG7_EPTYPE_INTERRUPT_Val << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_REPNB_Pos       16           /**< \brief (USBC_UECFG7) Redirected Endpoint Number */
#define USBC_UECFG7_REPNB_Msk       (0xFu << USBC_UECFG7_REPNB_Pos)
#define USBC_UECFG7_REPNB(value)    ((USBC_UECFG7_REPNB_Msk & ((value) << USBC_UECFG7_REPNB_Pos)))
#define USBC_UECFG7_MASK            0x000F1974u  /**< \brief (USBC_UECFG7) MASK Register */

/* -------- USBC_UESTA0 : (USBC Offset: 0x130) (R/  32) Endpoint Status Register -------- */
#define USBC_UESTA0_OFFSET          0x130        /**< \brief (USBC_UESTA0 offset) Endpoint Status Register */
#define USBC_UESTA0_RESETVALUE      0x00000100   /**< \brief (USBC_UESTA0 reset_value) Endpoint Status Register */

#define USBC_UESTA0_TXINI_Pos       0            /**< \brief (USBC_UESTA0) Transmitted IN Data Interrupt */
#define USBC_UESTA0_TXINI           (0x1u << USBC_UESTA0_TXINI_Pos)
#define USBC_UESTA0_RXOUTI_Pos      1            /**< \brief (USBC_UESTA0) Received OUT Data Interrupt */
#define USBC_UESTA0_RXOUTI          (0x1u << USBC_UESTA0_RXOUTI_Pos)
#define USBC_UESTA0_RXSTPI_Pos      2            /**< \brief (USBC_UESTA0) Received SETUP Interrupt */
#define USBC_UESTA0_RXSTPI          (0x1u << USBC_UESTA0_RXSTPI_Pos)
#define USBC_UESTA0_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA0) NAKed OUT Interrupt */
#define USBC_UESTA0_NAKOUTI         (0x1u << USBC_UESTA0_NAKOUTI_Pos)
#define USBC_UESTA0_NAKINI_Pos      4            /**< \brief (USBC_UESTA0) NAKed IN Interrupt */
#define USBC_UESTA0_NAKINI          (0x1u << USBC_UESTA0_NAKINI_Pos)
#define USBC_UESTA0_STALLEDI_Pos    6            /**< \brief (USBC_UESTA0) STALLed Interrupt */
#define USBC_UESTA0_STALLEDI        (0x1u << USBC_UESTA0_STALLEDI_Pos)
#define USBC_UESTA0_DTSEQ_Pos       8            /**< \brief (USBC_UESTA0) Data Toggle Sequence */
#define USBC_UESTA0_DTSEQ_Msk       (0x3u << USBC_UESTA0_DTSEQ_Pos)
#define USBC_UESTA0_DTSEQ(value)    ((USBC_UESTA0_DTSEQ_Msk & ((value) << USBC_UESTA0_DTSEQ_Pos)))
#define USBC_UESTA0_RAMACERI_Pos    11           /**< \brief (USBC_UESTA0) Ram Access Error Interrupt */
#define USBC_UESTA0_RAMACERI        (0x1u << USBC_UESTA0_RAMACERI_Pos)
#define USBC_UESTA0_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA0) Number Of Busy Banks */
#define USBC_UESTA0_NBUSYBK_Msk     (0x3u << USBC_UESTA0_NBUSYBK_Pos)
#define USBC_UESTA0_NBUSYBK(value)  ((USBC_UESTA0_NBUSYBK_Msk & ((value) << USBC_UESTA0_NBUSYBK_Pos)))
#define USBC_UESTA0_CURRBK_Pos      14           /**< \brief (USBC_UESTA0) Current Bank */
#define USBC_UESTA0_CURRBK_Msk      (0x3u << USBC_UESTA0_CURRBK_Pos)
#define USBC_UESTA0_CURRBK(value)   ((USBC_UESTA0_CURRBK_Msk & ((value) << USBC_UESTA0_CURRBK_Pos)))
#define USBC_UESTA0_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA0) Control Direction */
#define USBC_UESTA0_CTRLDIR         (0x1u << USBC_UESTA0_CTRLDIR_Pos)
#define   USBC_UESTA0_CTRLDIR_OUT_Val     0x0u   /**< \brief (USBC_UESTA0)  */
#define   USBC_UESTA0_CTRLDIR_IN_Val      0x1u   /**< \brief (USBC_UESTA0)  */
#define USBC_UESTA0_CTRLDIR_OUT     (USBC_UESTA0_CTRLDIR_OUT_Val   << USBC_UESTA0_CTRLDIR_Pos)
#define USBC_UESTA0_CTRLDIR_IN      (USBC_UESTA0_CTRLDIR_IN_Val    << USBC_UESTA0_CTRLDIR_Pos)
#define USBC_UESTA0_MASK            0x0002FB5Fu  /**< \brief (USBC_UESTA0) MASK Register */

