synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usbc.h
/* -------- USBC_UHSOFC : (USBC Offset: 0x424) (R/W 32) Host Start of Frame Control Register -------- */
#define USBC_UHSOFC_OFFSET          0x424        /**< \brief (USBC_UHSOFC offset) Host Start of Frame Control Register */
#define USBC_UHSOFC_RESETVALUE      0x00000000   /**< \brief (USBC_UHSOFC reset_value) Host Start of Frame Control Register */

#define USBC_UHSOFC_FLENC_Pos       0            /**< \brief (USBC_UHSOFC) Frame Length Control */
#define USBC_UHSOFC_FLENC_Msk       (0x3FFFu << USBC_UHSOFC_FLENC_Pos)
#define USBC_UHSOFC_FLENC(value)    ((USBC_UHSOFC_FLENC_Msk & ((value) << USBC_UHSOFC_FLENC_Pos)))
#define USBC_UHSOFC_FLENCE_Pos      16           /**< \brief (USBC_UHSOFC) Frame Length Control Enable */
#define USBC_UHSOFC_FLENCE          (0x1u << USBC_UHSOFC_FLENCE_Pos)
#define USBC_UHSOFC_MASK            0x00013FFFu  /**< \brief (USBC_UHSOFC) MASK Register */

/* -------- USBC_UPCFG0 : (USBC Offset: 0x500) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG0_OFFSET          0x500        /**< \brief (USBC_UPCFG0 offset) Pipe Configuration Register */
#define USBC_UPCFG0_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG0 reset_value) Pipe Configuration Register */

#define USBC_UPCFG0_PBK_Pos         2            /**< \brief (USBC_UPCFG0) Pipe Banks */
#define USBC_UPCFG0_PBK             (0x1u << USBC_UPCFG0_PBK_Pos)
#define   USBC_UPCFG0_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PBK_SINGLE      (USBC_UPCFG0_PBK_SINGLE_Val    << USBC_UPCFG0_PBK_Pos)
#define USBC_UPCFG0_PBK_DOUBLE      (USBC_UPCFG0_PBK_DOUBLE_Val    << USBC_UPCFG0_PBK_Pos)
#define USBC_UPCFG0_PSIZE_Pos       4            /**< \brief (USBC_UPCFG0) Pipe Size */
#define USBC_UPCFG0_PSIZE_Msk       (0x7u << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE(value)    ((USBC_UPCFG0_PSIZE_Msk & ((value) << USBC_UPCFG0_PSIZE_Pos)))
#define   USBC_UPCFG0_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PSIZE_8         (USBC_UPCFG0_PSIZE_8_Val       << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE_16        (USBC_UPCFG0_PSIZE_16_Val      << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE_32        (USBC_UPCFG0_PSIZE_32_Val      << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE_64        (USBC_UPCFG0_PSIZE_64_Val      << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE_128       (USBC_UPCFG0_PSIZE_128_Val     << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE_256       (USBC_UPCFG0_PSIZE_256_Val     << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE_512       (USBC_UPCFG0_PSIZE_512_Val     << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PSIZE_1024      (USBC_UPCFG0_PSIZE_1024_Val    << USBC_UPCFG0_PSIZE_Pos)
#define USBC_UPCFG0_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG0) Pipe Token */
#define USBC_UPCFG0_PTOKEN_Msk      (0x3u << USBC_UPCFG0_PTOKEN_Pos)
#define USBC_UPCFG0_PTOKEN(value)   ((USBC_UPCFG0_PTOKEN_Msk & ((value) << USBC_UPCFG0_PTOKEN_Pos)))
#define   USBC_UPCFG0_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PTOKEN_SETUP    (USBC_UPCFG0_PTOKEN_SETUP_Val  << USBC_UPCFG0_PTOKEN_Pos)
#define USBC_UPCFG0_PTOKEN_IN       (USBC_UPCFG0_PTOKEN_IN_Val     << USBC_UPCFG0_PTOKEN_Pos)
#define USBC_UPCFG0_PTOKEN_OUT      (USBC_UPCFG0_PTOKEN_OUT_Val    << USBC_UPCFG0_PTOKEN_Pos)
#define USBC_UPCFG0_PTYPE_Pos       12           /**< \brief (USBC_UPCFG0) Pipe Type */
#define USBC_UPCFG0_PTYPE_Msk       (0x3u << USBC_UPCFG0_PTYPE_Pos)
#define USBC_UPCFG0_PTYPE(value)    ((USBC_UPCFG0_PTYPE_Msk & ((value) << USBC_UPCFG0_PTYPE_Pos)))
#define   USBC_UPCFG0_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PTYPE_CONTROL   (USBC_UPCFG0_PTYPE_CONTROL_Val << USBC_UPCFG0_PTYPE_Pos)
#define USBC_UPCFG0_PTYPE_ISOCHRONOUS (USBC_UPCFG0_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG0_PTYPE_Pos)
#define USBC_UPCFG0_PTYPE_BULK      (USBC_UPCFG0_PTYPE_BULK_Val    << USBC_UPCFG0_PTYPE_Pos)
#define USBC_UPCFG0_PTYPE_INTERRUPT (USBC_UPCFG0_PTYPE_INTERRUPT_Val << USBC_UPCFG0_PTYPE_Pos)
#define USBC_UPCFG0_PINGEN_Pos      20           /**< \brief (USBC_UPCFG0) Ping Enable */
#define USBC_UPCFG0_PINGEN          (0x1u << USBC_UPCFG0_PINGEN_Pos)
#define USBC_UPCFG0_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG0) binterval parameter */
#define USBC_UPCFG0_BINTERVAL_Msk   (0xFFu << USBC_UPCFG0_BINTERVAL_Pos)
#define USBC_UPCFG0_BINTERVAL(value) ((USBC_UPCFG0_BINTERVAL_Msk & ((value) << USBC_UPCFG0_BINTERVAL_Pos)))
#define USBC_UPCFG0_MASK            0xFF103374u  /**< \brief (USBC_UPCFG0) MASK Register */

/* -------- USBC_UPCFG1 : (USBC Offset: 0x504) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG1_OFFSET          0x504        /**< \brief (USBC_UPCFG1 offset) Pipe Configuration Register */
#define USBC_UPCFG1_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG1 reset_value) Pipe Configuration Register */

#define USBC_UPCFG1_PBK_Pos         2            /**< \brief (USBC_UPCFG1) Pipe Banks */
#define USBC_UPCFG1_PBK             (0x1u << USBC_UPCFG1_PBK_Pos)
#define   USBC_UPCFG1_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PBK_SINGLE      (USBC_UPCFG1_PBK_SINGLE_Val    << USBC_UPCFG1_PBK_Pos)
#define USBC_UPCFG1_PBK_DOUBLE      (USBC_UPCFG1_PBK_DOUBLE_Val    << USBC_UPCFG1_PBK_Pos)
#define USBC_UPCFG1_PSIZE_Pos       4            /**< \brief (USBC_UPCFG1) Pipe Size */
#define USBC_UPCFG1_PSIZE_Msk       (0x7u << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE(value)    ((USBC_UPCFG1_PSIZE_Msk & ((value) << USBC_UPCFG1_PSIZE_Pos)))
#define   USBC_UPCFG1_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PSIZE_8         (USBC_UPCFG1_PSIZE_8_Val       << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_16        (USBC_UPCFG1_PSIZE_16_Val      << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_32        (USBC_UPCFG1_PSIZE_32_Val      << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_64        (USBC_UPCFG1_PSIZE_64_Val      << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_128       (USBC_UPCFG1_PSIZE_128_Val     << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_256       (USBC_UPCFG1_PSIZE_256_Val     << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_512       (USBC_UPCFG1_PSIZE_512_Val     << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_1024      (USBC_UPCFG1_PSIZE_1024_Val    << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG1) Pipe Token */
#define USBC_UPCFG1_PTOKEN_Msk      (0x3u << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTOKEN(value)   ((USBC_UPCFG1_PTOKEN_Msk & ((value) << USBC_UPCFG1_PTOKEN_Pos)))
#define   USBC_UPCFG1_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PTOKEN_SETUP    (USBC_UPCFG1_PTOKEN_SETUP_Val  << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTOKEN_IN       (USBC_UPCFG1_PTOKEN_IN_Val     << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTOKEN_OUT      (USBC_UPCFG1_PTOKEN_OUT_Val    << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTYPE_Pos       12           /**< \brief (USBC_UPCFG1) Pipe Type */
#define USBC_UPCFG1_PTYPE_Msk       (0x3u << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE(value)    ((USBC_UPCFG1_PTYPE_Msk & ((value) << USBC_UPCFG1_PTYPE_Pos)))
#define   USBC_UPCFG1_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PTYPE_CONTROL   (USBC_UPCFG1_PTYPE_CONTROL_Val << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE_ISOCHRONOUS (USBC_UPCFG1_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE_BULK      (USBC_UPCFG1_PTYPE_BULK_Val    << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE_INTERRUPT (USBC_UPCFG1_PTYPE_INTERRUPT_Val << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PINGEN_Pos      20           /**< \brief (USBC_UPCFG1) Ping Enable */
#define USBC_UPCFG1_PINGEN          (0x1u << USBC_UPCFG1_PINGEN_Pos)
#define USBC_UPCFG1_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG1) binterval parameter */
#define USBC_UPCFG1_BINTERVAL_Msk   (0xFFu << USBC_UPCFG1_BINTERVAL_Pos)
#define USBC_UPCFG1_BINTERVAL(value) ((USBC_UPCFG1_BINTERVAL_Msk & ((value) << USBC_UPCFG1_BINTERVAL_Pos)))
#define USBC_UPCFG1_MASK            0xFF103374u  /**< \brief (USBC_UPCFG1) MASK Register */

/* -------- USBC_UPCFG2 : (USBC Offset: 0x508) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG2_OFFSET          0x508        /**< \brief (USBC_UPCFG2 offset) Pipe Configuration Register */
#define USBC_UPCFG2_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG2 reset_value) Pipe Configuration Register */

#define USBC_UPCFG2_PBK_Pos         2            /**< \brief (USBC_UPCFG2) Pipe Banks */
#define USBC_UPCFG2_PBK             (0x1u << USBC_UPCFG2_PBK_Pos)
#define   USBC_UPCFG2_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PBK_SINGLE      (USBC_UPCFG2_PBK_SINGLE_Val    << USBC_UPCFG2_PBK_Pos)
#define USBC_UPCFG2_PBK_DOUBLE      (USBC_UPCFG2_PBK_DOUBLE_Val    << USBC_UPCFG2_PBK_Pos)
#define USBC_UPCFG2_PSIZE_Pos       4            /**< \brief (USBC_UPCFG2) Pipe Size */
#define USBC_UPCFG2_PSIZE_Msk       (0x7u << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE(value)    ((USBC_UPCFG2_PSIZE_Msk & ((value) << USBC_UPCFG2_PSIZE_Pos)))
#define   USBC_UPCFG2_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PSIZE_8         (USBC_UPCFG2_PSIZE_8_Val       << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_16        (USBC_UPCFG2_PSIZE_16_Val      << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_32        (USBC_UPCFG2_PSIZE_32_Val      << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_64        (USBC_UPCFG2_PSIZE_64_Val      << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_128       (USBC_UPCFG2_PSIZE_128_Val     << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_256       (USBC_UPCFG2_PSIZE_256_Val     << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_512       (USBC_UPCFG2_PSIZE_512_Val     << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_1024      (USBC_UPCFG2_PSIZE_1024_Val    << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG2) Pipe Token */
#define USBC_UPCFG2_PTOKEN_Msk      (0x3u << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTOKEN(value)   ((USBC_UPCFG2_PTOKEN_Msk & ((value) << USBC_UPCFG2_PTOKEN_Pos)))
#define   USBC_UPCFG2_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PTOKEN_SETUP    (USBC_UPCFG2_PTOKEN_SETUP_Val  << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTOKEN_IN       (USBC_UPCFG2_PTOKEN_IN_Val     << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTOKEN_OUT      (USBC_UPCFG2_PTOKEN_OUT_Val    << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTYPE_Pos       12           /**< \brief (USBC_UPCFG2) Pipe Type */
#define USBC_UPCFG2_PTYPE_Msk       (0x3u << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE(value)    ((USBC_UPCFG2_PTYPE_Msk & ((value) << USBC_UPCFG2_PTYPE_Pos)))
#define   USBC_UPCFG2_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PTYPE_CONTROL   (USBC_UPCFG2_PTYPE_CONTROL_Val << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE_ISOCHRONOUS (USBC_UPCFG2_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE_BULK      (USBC_UPCFG2_PTYPE_BULK_Val    << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE_INTERRUPT (USBC_UPCFG2_PTYPE_INTERRUPT_Val << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PINGEN_Pos      20           /**< \brief (USBC_UPCFG2) Ping Enable */
#define USBC_UPCFG2_PINGEN          (0x1u << USBC_UPCFG2_PINGEN_Pos)
#define USBC_UPCFG2_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG2) binterval parameter */
#define USBC_UPCFG2_BINTERVAL_Msk   (0xFFu << USBC_UPCFG2_BINTERVAL_Pos)
#define USBC_UPCFG2_BINTERVAL(value) ((USBC_UPCFG2_BINTERVAL_Msk & ((value) << USBC_UPCFG2_BINTERVAL_Pos)))
#define USBC_UPCFG2_MASK            0xFF103374u  /**< \brief (USBC_UPCFG2) MASK Register */

/* -------- USBC_UPCFG3 : (USBC Offset: 0x50C) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG3_OFFSET          0x50C        /**< \brief (USBC_UPCFG3 offset) Pipe Configuration Register */
#define USBC_UPCFG3_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG3 reset_value) Pipe Configuration Register */

#define USBC_UPCFG3_PBK_Pos         2            /**< \brief (USBC_UPCFG3) Pipe Banks */
#define USBC_UPCFG3_PBK             (0x1u << USBC_UPCFG3_PBK_Pos)
#define   USBC_UPCFG3_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PBK_SINGLE      (USBC_UPCFG3_PBK_SINGLE_Val    << USBC_UPCFG3_PBK_Pos)
#define USBC_UPCFG3_PBK_DOUBLE      (USBC_UPCFG3_PBK_DOUBLE_Val    << USBC_UPCFG3_PBK_Pos)
#define USBC_UPCFG3_PSIZE_Pos       4            /**< \brief (USBC_UPCFG3) Pipe Size */
#define USBC_UPCFG3_PSIZE_Msk       (0x7u << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE(value)    ((USBC_UPCFG3_PSIZE_Msk & ((value) << USBC_UPCFG3_PSIZE_Pos)))
#define   USBC_UPCFG3_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PSIZE_8         (USBC_UPCFG3_PSIZE_8_Val       << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE_16        (USBC_UPCFG3_PSIZE_16_Val      << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE_32        (USBC_UPCFG3_PSIZE_32_Val      << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE_64        (USBC_UPCFG3_PSIZE_64_Val      << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE_128       (USBC_UPCFG3_PSIZE_128_Val     << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE_256       (USBC_UPCFG3_PSIZE_256_Val     << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE_512       (USBC_UPCFG3_PSIZE_512_Val     << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PSIZE_1024      (USBC_UPCFG3_PSIZE_1024_Val    << USBC_UPCFG3_PSIZE_Pos)
#define USBC_UPCFG3_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG3) Pipe Token */
#define USBC_UPCFG3_PTOKEN_Msk      (0x3u << USBC_UPCFG3_PTOKEN_Pos)
#define USBC_UPCFG3_PTOKEN(value)   ((USBC_UPCFG3_PTOKEN_Msk & ((value) << USBC_UPCFG3_PTOKEN_Pos)))
#define   USBC_UPCFG3_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PTOKEN_SETUP    (USBC_UPCFG3_PTOKEN_SETUP_Val  << USBC_UPCFG3_PTOKEN_Pos)
#define USBC_UPCFG3_PTOKEN_IN       (USBC_UPCFG3_PTOKEN_IN_Val     << USBC_UPCFG3_PTOKEN_Pos)
#define USBC_UPCFG3_PTOKEN_OUT      (USBC_UPCFG3_PTOKEN_OUT_Val    << USBC_UPCFG3_PTOKEN_Pos)
#define USBC_UPCFG3_PTYPE_Pos       12           /**< \brief (USBC_UPCFG3) Pipe Type */
#define USBC_UPCFG3_PTYPE_Msk       (0x3u << USBC_UPCFG3_PTYPE_Pos)
#define USBC_UPCFG3_PTYPE(value)    ((USBC_UPCFG3_PTYPE_Msk & ((value) << USBC_UPCFG3_PTYPE_Pos)))
#define   USBC_UPCFG3_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PTYPE_CONTROL   (USBC_UPCFG3_PTYPE_CONTROL_Val << USBC_UPCFG3_PTYPE_Pos)
#define USBC_UPCFG3_PTYPE_ISOCHRONOUS (USBC_UPCFG3_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG3_PTYPE_Pos)
#define USBC_UPCFG3_PTYPE_BULK      (USBC_UPCFG3_PTYPE_BULK_Val    << USBC_UPCFG3_PTYPE_Pos)
#define USBC_UPCFG3_PTYPE_INTERRUPT (USBC_UPCFG3_PTYPE_INTERRUPT_Val << USBC_UPCFG3_PTYPE_Pos)
#define USBC_UPCFG3_PINGEN_Pos      20           /**< \brief (USBC_UPCFG3) Ping Enable */
#define USBC_UPCFG3_PINGEN          (0x1u << USBC_UPCFG3_PINGEN_Pos)
#define USBC_UPCFG3_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG3) binterval parameter */
#define USBC_UPCFG3_BINTERVAL_Msk   (0xFFu << USBC_UPCFG3_BINTERVAL_Pos)
#define USBC_UPCFG3_BINTERVAL(value) ((USBC_UPCFG3_BINTERVAL_Msk & ((value) << USBC_UPCFG3_BINTERVAL_Pos)))
#define USBC_UPCFG3_MASK            0xFF103374u  /**< \brief (USBC_UPCFG3) MASK Register */

