synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usbc.h
/* -------- USBC_UPCFG4 : (USBC Offset: 0x510) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG4_OFFSET          0x510        /**< \brief (USBC_UPCFG4 offset) Pipe Configuration Register */
#define USBC_UPCFG4_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG4 reset_value) Pipe Configuration Register */

#define USBC_UPCFG4_PBK_Pos         2            /**< \brief (USBC_UPCFG4) Pipe Banks */
#define USBC_UPCFG4_PBK             (0x1u << USBC_UPCFG4_PBK_Pos)
#define   USBC_UPCFG4_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PBK_SINGLE      (USBC_UPCFG4_PBK_SINGLE_Val    << USBC_UPCFG4_PBK_Pos)
#define USBC_UPCFG4_PBK_DOUBLE      (USBC_UPCFG4_PBK_DOUBLE_Val    << USBC_UPCFG4_PBK_Pos)
#define USBC_UPCFG4_PSIZE_Pos       4            /**< \brief (USBC_UPCFG4) Pipe Size */
#define USBC_UPCFG4_PSIZE_Msk       (0x7u << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE(value)    ((USBC_UPCFG4_PSIZE_Msk & ((value) << USBC_UPCFG4_PSIZE_Pos)))
#define   USBC_UPCFG4_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PSIZE_8         (USBC_UPCFG4_PSIZE_8_Val       << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE_16        (USBC_UPCFG4_PSIZE_16_Val      << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE_32        (USBC_UPCFG4_PSIZE_32_Val      << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE_64        (USBC_UPCFG4_PSIZE_64_Val      << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE_128       (USBC_UPCFG4_PSIZE_128_Val     << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE_256       (USBC_UPCFG4_PSIZE_256_Val     << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE_512       (USBC_UPCFG4_PSIZE_512_Val     << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PSIZE_1024      (USBC_UPCFG4_PSIZE_1024_Val    << USBC_UPCFG4_PSIZE_Pos)
#define USBC_UPCFG4_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG4) Pipe Token */
#define USBC_UPCFG4_PTOKEN_Msk      (0x3u << USBC_UPCFG4_PTOKEN_Pos)
#define USBC_UPCFG4_PTOKEN(value)   ((USBC_UPCFG4_PTOKEN_Msk & ((value) << USBC_UPCFG4_PTOKEN_Pos)))
#define   USBC_UPCFG4_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PTOKEN_SETUP    (USBC_UPCFG4_PTOKEN_SETUP_Val  << USBC_UPCFG4_PTOKEN_Pos)
#define USBC_UPCFG4_PTOKEN_IN       (USBC_UPCFG4_PTOKEN_IN_Val     << USBC_UPCFG4_PTOKEN_Pos)
#define USBC_UPCFG4_PTOKEN_OUT      (USBC_UPCFG4_PTOKEN_OUT_Val    << USBC_UPCFG4_PTOKEN_Pos)
#define USBC_UPCFG4_PTYPE_Pos       12           /**< \brief (USBC_UPCFG4) Pipe Type */
#define USBC_UPCFG4_PTYPE_Msk       (0x3u << USBC_UPCFG4_PTYPE_Pos)
#define USBC_UPCFG4_PTYPE(value)    ((USBC_UPCFG4_PTYPE_Msk & ((value) << USBC_UPCFG4_PTYPE_Pos)))
#define   USBC_UPCFG4_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PTYPE_CONTROL   (USBC_UPCFG4_PTYPE_CONTROL_Val << USBC_UPCFG4_PTYPE_Pos)
#define USBC_UPCFG4_PTYPE_ISOCHRONOUS (USBC_UPCFG4_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG4_PTYPE_Pos)
#define USBC_UPCFG4_PTYPE_BULK      (USBC_UPCFG4_PTYPE_BULK_Val    << USBC_UPCFG4_PTYPE_Pos)
#define USBC_UPCFG4_PTYPE_INTERRUPT (USBC_UPCFG4_PTYPE_INTERRUPT_Val << USBC_UPCFG4_PTYPE_Pos)
#define USBC_UPCFG4_PINGEN_Pos      20           /**< \brief (USBC_UPCFG4) Ping Enable */
#define USBC_UPCFG4_PINGEN          (0x1u << USBC_UPCFG4_PINGEN_Pos)
#define USBC_UPCFG4_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG4) binterval parameter */
#define USBC_UPCFG4_BINTERVAL_Msk   (0xFFu << USBC_UPCFG4_BINTERVAL_Pos)
#define USBC_UPCFG4_BINTERVAL(value) ((USBC_UPCFG4_BINTERVAL_Msk & ((value) << USBC_UPCFG4_BINTERVAL_Pos)))
#define USBC_UPCFG4_MASK            0xFF103374u  /**< \brief (USBC_UPCFG4) MASK Register */

/* -------- USBC_UPCFG5 : (USBC Offset: 0x514) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG5_OFFSET          0x514        /**< \brief (USBC_UPCFG5 offset) Pipe Configuration Register */
#define USBC_UPCFG5_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG5 reset_value) Pipe Configuration Register */

#define USBC_UPCFG5_PBK_Pos         2            /**< \brief (USBC_UPCFG5) Pipe Banks */
#define USBC_UPCFG5_PBK             (0x1u << USBC_UPCFG5_PBK_Pos)
#define   USBC_UPCFG5_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG5)  */
#define USBC_UPCFG5_PBK_SINGLE      (USBC_UPCFG5_PBK_SINGLE_Val    << USBC_UPCFG5_PBK_Pos)
#define USBC_UPCFG5_PBK_DOUBLE      (USBC_UPCFG5_PBK_DOUBLE_Val    << USBC_UPCFG5_PBK_Pos)
#define USBC_UPCFG5_PSIZE_Pos       4            /**< \brief (USBC_UPCFG5) Pipe Size */
#define USBC_UPCFG5_PSIZE_Msk       (0x7u << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE(value)    ((USBC_UPCFG5_PSIZE_Msk & ((value) << USBC_UPCFG5_PSIZE_Pos)))
#define   USBC_UPCFG5_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG5)  */
#define USBC_UPCFG5_PSIZE_8         (USBC_UPCFG5_PSIZE_8_Val       << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE_16        (USBC_UPCFG5_PSIZE_16_Val      << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE_32        (USBC_UPCFG5_PSIZE_32_Val      << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE_64        (USBC_UPCFG5_PSIZE_64_Val      << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE_128       (USBC_UPCFG5_PSIZE_128_Val     << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE_256       (USBC_UPCFG5_PSIZE_256_Val     << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE_512       (USBC_UPCFG5_PSIZE_512_Val     << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PSIZE_1024      (USBC_UPCFG5_PSIZE_1024_Val    << USBC_UPCFG5_PSIZE_Pos)
#define USBC_UPCFG5_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG5) Pipe Token */
#define USBC_UPCFG5_PTOKEN_Msk      (0x3u << USBC_UPCFG5_PTOKEN_Pos)
#define USBC_UPCFG5_PTOKEN(value)   ((USBC_UPCFG5_PTOKEN_Msk & ((value) << USBC_UPCFG5_PTOKEN_Pos)))
#define   USBC_UPCFG5_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG5)  */
#define USBC_UPCFG5_PTOKEN_SETUP    (USBC_UPCFG5_PTOKEN_SETUP_Val  << USBC_UPCFG5_PTOKEN_Pos)
#define USBC_UPCFG5_PTOKEN_IN       (USBC_UPCFG5_PTOKEN_IN_Val     << USBC_UPCFG5_PTOKEN_Pos)
#define USBC_UPCFG5_PTOKEN_OUT      (USBC_UPCFG5_PTOKEN_OUT_Val    << USBC_UPCFG5_PTOKEN_Pos)
#define USBC_UPCFG5_PTYPE_Pos       12           /**< \brief (USBC_UPCFG5) Pipe Type */
#define USBC_UPCFG5_PTYPE_Msk       (0x3u << USBC_UPCFG5_PTYPE_Pos)
#define USBC_UPCFG5_PTYPE(value)    ((USBC_UPCFG5_PTYPE_Msk & ((value) << USBC_UPCFG5_PTYPE_Pos)))
#define   USBC_UPCFG5_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG5)  */
#define USBC_UPCFG5_PTYPE_CONTROL   (USBC_UPCFG5_PTYPE_CONTROL_Val << USBC_UPCFG5_PTYPE_Pos)
#define USBC_UPCFG5_PTYPE_ISOCHRONOUS (USBC_UPCFG5_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG5_PTYPE_Pos)
#define USBC_UPCFG5_PTYPE_BULK      (USBC_UPCFG5_PTYPE_BULK_Val    << USBC_UPCFG5_PTYPE_Pos)
#define USBC_UPCFG5_PTYPE_INTERRUPT (USBC_UPCFG5_PTYPE_INTERRUPT_Val << USBC_UPCFG5_PTYPE_Pos)
#define USBC_UPCFG5_PINGEN_Pos      20           /**< \brief (USBC_UPCFG5) Ping Enable */
#define USBC_UPCFG5_PINGEN          (0x1u << USBC_UPCFG5_PINGEN_Pos)
#define USBC_UPCFG5_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG5) binterval parameter */
#define USBC_UPCFG5_BINTERVAL_Msk   (0xFFu << USBC_UPCFG5_BINTERVAL_Pos)
#define USBC_UPCFG5_BINTERVAL(value) ((USBC_UPCFG5_BINTERVAL_Msk & ((value) << USBC_UPCFG5_BINTERVAL_Pos)))
#define USBC_UPCFG5_MASK            0xFF103374u  /**< \brief (USBC_UPCFG5) MASK Register */

