synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usbc.h
/* -------- USBC_UPCFG6 : (USBC Offset: 0x518) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG6_OFFSET          0x518        /**< \brief (USBC_UPCFG6 offset) Pipe Configuration Register */
#define USBC_UPCFG6_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG6 reset_value) Pipe Configuration Register */

#define USBC_UPCFG6_PBK_Pos         2            /**< \brief (USBC_UPCFG6) Pipe Banks */
#define USBC_UPCFG6_PBK             (0x1u << USBC_UPCFG6_PBK_Pos)
#define   USBC_UPCFG6_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PBK_SINGLE      (USBC_UPCFG6_PBK_SINGLE_Val    << USBC_UPCFG6_PBK_Pos)
#define USBC_UPCFG6_PBK_DOUBLE      (USBC_UPCFG6_PBK_DOUBLE_Val    << USBC_UPCFG6_PBK_Pos)
#define USBC_UPCFG6_PSIZE_Pos       4            /**< \brief (USBC_UPCFG6) Pipe Size */
#define USBC_UPCFG6_PSIZE_Msk       (0x7u << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE(value)    ((USBC_UPCFG6_PSIZE_Msk & ((value) << USBC_UPCFG6_PSIZE_Pos)))
#define   USBC_UPCFG6_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PSIZE_8         (USBC_UPCFG6_PSIZE_8_Val       << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_16        (USBC_UPCFG6_PSIZE_16_Val      << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_32        (USBC_UPCFG6_PSIZE_32_Val      << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_64        (USBC_UPCFG6_PSIZE_64_Val      << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_128       (USBC_UPCFG6_PSIZE_128_Val     << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_256       (USBC_UPCFG6_PSIZE_256_Val     << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_512       (USBC_UPCFG6_PSIZE_512_Val     << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_1024      (USBC_UPCFG6_PSIZE_1024_Val    << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG6) Pipe Token */
#define USBC_UPCFG6_PTOKEN_Msk      (0x3u << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTOKEN(value)   ((USBC_UPCFG6_PTOKEN_Msk & ((value) << USBC_UPCFG6_PTOKEN_Pos)))
#define   USBC_UPCFG6_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PTOKEN_SETUP    (USBC_UPCFG6_PTOKEN_SETUP_Val  << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTOKEN_IN       (USBC_UPCFG6_PTOKEN_IN_Val     << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTOKEN_OUT      (USBC_UPCFG6_PTOKEN_OUT_Val    << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTYPE_Pos       12           /**< \brief (USBC_UPCFG6) Pipe Type */
#define USBC_UPCFG6_PTYPE_Msk       (0x3u << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE(value)    ((USBC_UPCFG6_PTYPE_Msk & ((value) << USBC_UPCFG6_PTYPE_Pos)))
#define   USBC_UPCFG6_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PTYPE_CONTROL   (USBC_UPCFG6_PTYPE_CONTROL_Val << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE_ISOCHRONOUS (USBC_UPCFG6_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE_BULK      (USBC_UPCFG6_PTYPE_BULK_Val    << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE_INTERRUPT (USBC_UPCFG6_PTYPE_INTERRUPT_Val << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PINGEN_Pos      20           /**< \brief (USBC_UPCFG6) Ping Enable */
#define USBC_UPCFG6_PINGEN          (0x1u << USBC_UPCFG6_PINGEN_Pos)
#define USBC_UPCFG6_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG6) binterval parameter */
#define USBC_UPCFG6_BINTERVAL_Msk   (0xFFu << USBC_UPCFG6_BINTERVAL_Pos)
#define USBC_UPCFG6_BINTERVAL(value) ((USBC_UPCFG6_BINTERVAL_Msk & ((value) << USBC_UPCFG6_BINTERVAL_Pos)))
#define USBC_UPCFG6_MASK            0xFF103374u  /**< \brief (USBC_UPCFG6) MASK Register */

/* -------- USBC_UPCFG7 : (USBC Offset: 0x51C) (R/W 32) Pipe Configuration Register -------- */
#define USBC_UPCFG7_OFFSET          0x51C        /**< \brief (USBC_UPCFG7 offset) Pipe Configuration Register */
#define USBC_UPCFG7_RESETVALUE      0x00000000   /**< \brief (USBC_UPCFG7 reset_value) Pipe Configuration Register */

#define USBC_UPCFG7_PBK_Pos         2            /**< \brief (USBC_UPCFG7) Pipe Banks */
#define USBC_UPCFG7_PBK             (0x1u << USBC_UPCFG7_PBK_Pos)
#define   USBC_UPCFG7_PBK_SINGLE_Val      0x0u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PBK_DOUBLE_Val      0x1u   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PBK_SINGLE      (USBC_UPCFG7_PBK_SINGLE_Val    << USBC_UPCFG7_PBK_Pos)
#define USBC_UPCFG7_PBK_DOUBLE      (USBC_UPCFG7_PBK_DOUBLE_Val    << USBC_UPCFG7_PBK_Pos)
#define USBC_UPCFG7_PSIZE_Pos       4            /**< \brief (USBC_UPCFG7) Pipe Size */
#define USBC_UPCFG7_PSIZE_Msk       (0x7u << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE(value)    ((USBC_UPCFG7_PSIZE_Msk & ((value) << USBC_UPCFG7_PSIZE_Pos)))
#define   USBC_UPCFG7_PSIZE_8_Val         0x0u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_16_Val        0x1u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_32_Val        0x2u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_64_Val        0x3u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_128_Val       0x4u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_256_Val       0x5u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_512_Val       0x6u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_1024_Val      0x7u   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PSIZE_8         (USBC_UPCFG7_PSIZE_8_Val       << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_16        (USBC_UPCFG7_PSIZE_16_Val      << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_32        (USBC_UPCFG7_PSIZE_32_Val      << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_64        (USBC_UPCFG7_PSIZE_64_Val      << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_128       (USBC_UPCFG7_PSIZE_128_Val     << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_256       (USBC_UPCFG7_PSIZE_256_Val     << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_512       (USBC_UPCFG7_PSIZE_512_Val     << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_1024      (USBC_UPCFG7_PSIZE_1024_Val    << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG7) Pipe Token */
#define USBC_UPCFG7_PTOKEN_Msk      (0x3u << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTOKEN(value)   ((USBC_UPCFG7_PTOKEN_Msk & ((value) << USBC_UPCFG7_PTOKEN_Pos)))
#define   USBC_UPCFG7_PTOKEN_SETUP_Val    0x0u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTOKEN_IN_Val       0x1u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTOKEN_OUT_Val      0x2u   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PTOKEN_SETUP    (USBC_UPCFG7_PTOKEN_SETUP_Val  << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTOKEN_IN       (USBC_UPCFG7_PTOKEN_IN_Val     << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTOKEN_OUT      (USBC_UPCFG7_PTOKEN_OUT_Val    << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTYPE_Pos       12           /**< \brief (USBC_UPCFG7) Pipe Type */
#define USBC_UPCFG7_PTYPE_Msk       (0x3u << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE(value)    ((USBC_UPCFG7_PTYPE_Msk & ((value) << USBC_UPCFG7_PTYPE_Pos)))
#define   USBC_UPCFG7_PTYPE_CONTROL_Val   0x0u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_ISOCHRONOUS_Val 0x1u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_BULK_Val      0x2u   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_INTERRUPT_Val 0x3u   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PTYPE_CONTROL   (USBC_UPCFG7_PTYPE_CONTROL_Val << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE_ISOCHRONOUS (USBC_UPCFG7_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE_BULK      (USBC_UPCFG7_PTYPE_BULK_Val    << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE_INTERRUPT (USBC_UPCFG7_PTYPE_INTERRUPT_Val << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PINGEN_Pos      20           /**< \brief (USBC_UPCFG7) Ping Enable */
#define USBC_UPCFG7_PINGEN          (0x1u << USBC_UPCFG7_PINGEN_Pos)
#define USBC_UPCFG7_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG7) binterval parameter */
#define USBC_UPCFG7_BINTERVAL_Msk   (0xFFu << USBC_UPCFG7_BINTERVAL_Pos)
#define USBC_UPCFG7_BINTERVAL(value) ((USBC_UPCFG7_BINTERVAL_Msk & ((value) << USBC_UPCFG7_BINTERVAL_Pos)))
#define USBC_UPCFG7_MASK            0xFF103374u  /**< \brief (USBC_UPCFG7) MASK Register */

